
public class 문제 {
	
	public static void main(String[] args) {
		/*
		 *    1. 1
		 *    2. 1
		 *    3. 1
		 *    4. 2
		 *    5. 기본생성자가 없어서
		 *    6. 2
		 *    7. 3
		 *    8. 4
		 *    1. 2
		 *    2. 2
		 *    3. 2
		 *    4. 3
		 *    5. 4
		 *    6. 동일?
		 *    7. 단독사용가능 다중or단일 상속
		 *    8. 설계를 통해 개발시간 단축 , 요구사항 분석 , 표준화 , 다중상속 , 독립적 프로그래밍
		 *    9. e
		 *    10. a
		 *    11. b
		 *    12. c
		 *    13. ㅇㅇㅇㅇ ㅇㅇㅇㄴ ㅇㅇㄴㄴ ㅇㄴㄴㄴ
		 *    14. 2번째 줄
		 *    15. d
		 *    16. implements
		 *    17. 
		 *    
		 */
	}
}
