/*
 *     1. 단일 조건문
 *        형식)
 *            if(조건문
 *            {
 *            		조건문이 true면 수행하는 문장 작성
 *                  ---- 부정연산자(!), 비교연산자(==, !=, <, >, <=, >=)
 *                       논리연산자(&& , ||)만 사용이 가능
 *            }
 *     2. 선택 조건문
 *            if(조건문)
 *            {
 *            		조건문이 true면 수행하는 문장 작성
 *            }
 *            else
 *            {
 *            		조건문이 false면 수행하는 문장 작성
 *            } => else문장은 바로 위에있는 if문 소속 ( 전체로 하려면 괄호 필수 )
 *            
 *            if()
 *            {
 *            }
 *            -----------
 *            if() 	
 *            {		
 *            }
 *            else
 *            {
 *            }
 *            -----------
 *            => else 문은 단독으로 사용이 불가능하다 (반드시 if가 필요)
 *            
 *     3. 다중 조건문
 *            if(조건문)
 *            {
 *            		조건문이 true면					=>수행 후 종료
 *            		조건문이 false면  				=>다음 조건문을 찾는다
 *            }
 *            else if(조건문)
 *            {
 *            		조건문이 true면					=>수행 후 종료
 *            		조건문이 false면  				=>다음 조건문을 찾는다(다음 조건이 없을시 else로)
 *            }
 *            else
 *            {
 *            		// 해당 조건이 없는 경우 처리하는 소스 작성 (전체에대한 else)
 *            }
 *   --------------------------------------------------------------------------------------       
 *     4. 선택문
 *     5. 반복문 (for -1차)
 */
public class 제어문_정리 {
	public static void main(String[] args) {
		
	}
}
